test/tests/multiapps/warm_plate_par/buoyantCavity/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    left_back
    {
        type            noSlip;
    }
    left_bottom
    {
        type            noSlip;
    }
    left_left
    {
        type            noSlip;
    }
    left_front
    {
        type            noSlip;
    }
    left_top
    {
        type            noSlip;
    }
    int_back
    {
        type            noSlip;
    }
    int_bottom
    {
        type            noSlip;
    }
    int_front
    {
        type            noSlip;
    }
    int_top
    {
        type            noSlip;
    }
    right_back
    {
        type            noSlip;
    }
    right_bottom
    {
        type            noSlip;
    }
    right_front
    {
        type            noSlip;
    }
    right_right
    {
        type            noSlip;
    }
    right_top
    {
        type            noSlip;
    }
}


// ************************************************************************* //
